Revit 2027 API
BuiltInFailures.FamilyFailures.FormulaBasedParameterCannotBeChanged Property
 Parameter '[Caption]' cannot be changed because it is defined by formula '[Formula]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FormulaBasedParameterCannotBeChanged { get; }
Public Shared ReadOnly Property FormulaBasedParameterCannotBeChanged As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FormulaBasedParameterCannotBeChanged {
	FailureDefinitionId^ get ();
}
static member FormulaBasedParameterCannotBeChanged : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace